Firma/nalog_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:getNalogZaPlacanjeRequest xmlns:ns2="http://nalogZaPlacanje.com"><ns2:nalogZaPlacanje datumNaloga="2017-06-19" datumValute="2017-06-19+02:00" hitno="false"><ns2:idPoruke><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>SorF0ULYcWvAHo8wkiCkt+aqguPgpr5s9ZI+DC23U39lix+PoIwwaRqozciX42d4lq1var2gbjvR&#13;
7J+CXkkwnNXTsNYBZQFlP/zI4mSLtj41GWwsxSeQWbFI3rrqwoQzIY+7uSXvaV+uA8ivdxT8E725&#13;
2I9ScueUTPbykyxxroA=</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>cXJVojfvgKNe9RXeKfh22tNCwQ9uuxhK</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns2:idPoruke><ns2:duznik-nalogodavac>levi</ns2:duznik-nalogodavac><ns2:svrhaPlacanja>Svrha placanja</ns2:svrhaPlacanja><ns2:primalac-poverilac>ftn</ns2:primalac-poverilac><ns2:racunDuznika>200636547896321456</ns2:racunDuznika><ns2:modelZaduzenja>92</ns2:modelZaduzenja><ns2:pozivNaBrojZaduzenja>41247412</ns2:pozivNaBrojZaduzenja><ns2:racunPoverioca>400254547845612156</ns2:racunPoverioca><ns2:modelOdobrenja>97</ns2:modelOdobrenja><ns2:pozivNaBrojOdobrenja>147541214</ns2:pozivNaBrojOdobrenja><ns2:iznos>260000</ns2:iznos><ns2:oznakaValute>RSD</ns2:oznakaValute></ns2:nalogZaPlacanje></ns2:getNalogZaPlacanjeRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>Ig730UdMvg6ZltlF3vXPVJu/YRk=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
T1JJOrEVKm7k/J9X/Wex4ONSDpejv2onO0SyEQQ5IdBIdP2/3KQ8Pg9X/BuapeHF6kJsClPJ10aG&#13;
AmNf/xAlgbWQHJpPfufIbFIpi3sfN6TJh/Utq3AXvGEqiZV9zra861XiR7ts3FEwxSsSGDbH2Ofj&#13;
BlIzmyMQ8PUZuZbcth8=
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
zQ9KJLShafi/S2HkWlfnRpKcuLB4BgeJ5y2wBafGRRNz5kss0gjzzQZIDf684gwQ2WYEDlH2s+OX&#13;
fbX4v6KTKJ4ug0wfY05sciJ7Dx+HOPUw6KU5aWvbBIKAXJE+MCSaO/FSk+ujgXSZAY/epUsSqBo2&#13;
EZgUl90oEpTRbV+xX8E=
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIBtjCCAR8CBEZasCQwDQYJKoZIhvcNAQEFBQAwIjEPMA0GA1UECwwGcHJpbWVyMQ8wDQYDVQQD&#13;
DAZwcmltZXIwHhcNMDcwNTI4MTAzNDEyWhcNMjcwNTIzMTAzNDEyWjAiMQ8wDQYDVQQLDAZwcmlt&#13;
ZXIxDzANBgNVBAMMBnByaW1lcjCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAzQ9KJLShafi/&#13;
S2HkWlfnRpKcuLB4BgeJ5y2wBafGRRNz5kss0gjzzQZIDf684gwQ2WYEDlH2s+OXfbX4v6KTKJ4u&#13;
g0wfY05sciJ7Dx+HOPUw6KU5aWvbBIKAXJE+MCSaO/FSk+ujgXSZAY/epUsSqBo2EZgUl90oEpTR&#13;
bV+xX8ECAwEAATANBgkqhkiG9w0BAQUFAAOBgQB2HjPI427zRaVfLTaeNVcjH9hoTkl9OUJAAmEa&#13;
6EQdbdqZ75ca3IfuLHJFJ8zzyBP4LUGSxgA4OpnKs6Ej5w2n0GHmu0g4YqxInfpv/kCwswoia4Oz&#13;
a17te8mMamffCn3ySX5yZzEex5nueNAyhJkmWBcBCOvJw4+U+gSK50Xbcw==
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>